{
  "weather": [
    {
      "id": 0,
      "name": "Monday",
      "avgTemp": "Day: 27°C --- Night: 15°C",
      "image": "images/sun.png",
      "description": "High pressure will drift east of the region today followed by increasing clouds and perhaps a few light showers of rain or snow across the northern mountains of the state late this afternoon and evening as a warm front approaches from the west. Afternoon high temperatures today will return to the 40s across the higher elevations and 50s in the valleys of Central and Southern Pennsylvania."
    },
    {
      "id": 1,
      "name": "Tuesday",
      "avgTemp": "Day: 22°C --- Night: 13°C",
      "image": "images/cloud.png",
      "description": "Another cold night is expected across the Northeast heading into Wednesday, but subfreezing temperatures will be confined to New England where lows will be falling into the 20s. Farther south, low temperatures across the Mid-Atlantic will range between the 30s and 40s. "
    },
    {
      "id": 2,
      "name": "Wednesday",
      "avgTemp": "Day: 21°C --- Night: 10°C",
      "image": "images/cloud.png",
      "description": "Below average temperatures will continue across the Mid-Atlantic today with highs only reaching the lower 50s. Cooler daytime high temperatures will also continue across New England with highs only ranging between the mid-30s and 40s. "
    },
    {
      "id": 3,
      "name": "Thursday",
      "avgTemp": "Day: 26°C --- Night: 15°C",
      "image": "images/sun.png",
      "description": "In the next few days, sunny spells are likely. Rain will not occur during daytime. It is getting warmer - the temperature rises from 17 degrees on Thursday to 22 degrees on Friday."
    },
    {
      "id": 4,
      "name": "Friday",
      "avgTemp": "Day: 27°C --- Night: 17°C",
      "image": "images/sun.png",
      "description": "In the next few days, sunny spells are likely. Rain will not occur during daytime. It is getting warmer - the temperature rises from 17 degrees on Monday to 22 degrees on Tuesday."
    },
    {
      "id": 5,
      "name": "Saturday",
      "avgTemp": "'Day: 18°C --- Night: 9°C",
      "image": "images/storm.png",
      "description": "A late-season winter blast will produce another deep freeze well into the South and across the East this morning. Seasonably cool weather continues across the East today while another freeze is on tap for Sunday night across portions of New England. "
    },
    {
      "id": 6,
      "name": "Sunday",
      "avgTemp": "Day: 16°C --- Night: 7°C",
      "image": "images/storm.png",
      "description": "Easter Sunday will be a bit breezy as a weak, dry frontal boundary pushes through the area. Mild weather and dry conditions will continue through early in the upcoming week, followed by clouds and an increasing chance for showers Tuesday and Tuesday night."
    }
  ],
  "update": [
    {
      "location": "Meran",
      "id": 0
    },
    {
      "location": "Meran",
      "date": "2021-04-03T21:58:49.222Z",
      "id": 1
    },
    {
      "location": "Bozen",
      "date": "2021-04-03T21:59:02.921Z",
      "id": 2
    },
    {
      "location": "Meran",
      "date": "2021-04-03T22:12:05.236Z",
      "id": 3
    }
  ]
}